In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
#index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [4]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [5]:
inside

[1, 2, 3, 1, 2, 3]

In [6]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [7]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [10]:
df

             A         B
G1 1 -0.112725  1.305920
   2  0.764333  1.566932
   3  1.343939  0.447085
G2 1  0.402865  0.205851
   2  0.030848 -0.720126
   3  1.176042 -0.383805

In [11]:
df.loc['G1']

          A         B
1 -0.112725  1.305920
2  0.764333  1.566932
3  1.343939  0.447085

In [14]:
df.loc['G1'].loc[1]

A   -0.112725
B    1.305920
Name: 1, dtype: float64

In [16]:
df.index.names=['Groups','Num']

In [17]:
df

                   A         B
Groups Num
G1     1   -0.112725  1.305920
       2    0.764333  1.566932
       3    1.343939  0.447085
G2     1    0.402865  0.205851
       2    0.030848 -0.720126
       3    1.176042 -0.383805

In [18]:
df.loc['G2'].loc[2]['B']

-0.7201261327632995

In [19]:
df

                   A         B
Groups Num
G1     1   -0.112725  1.305920
       2    0.764333  1.566932
       3    1.343939  0.447085
G2     1    0.402865  0.205851
       2    0.030848 -0.720126
       3    1.176042 -0.383805

In [20]:
df.loc['G1']

            A         B
Num
1   -0.112725  1.305920
2    0.764333  1.566932
3    1.343939  0.447085

In [21]:
df.xs('G1')

            A         B
Num
1   -0.112725  1.305920
2    0.764333  1.566932
3    1.343939  0.447085

In [22]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.112725  1.305920
G2      0.402865  0.205851

In [23]:
df

                   A         B
Groups Num
G1     1   -0.112725  1.305920
       2    0.764333  1.566932
       3    1.343939  0.447085
G2     1    0.402865  0.205851
       2    0.030848 -0.720126
       3    1.176042 -0.383805